app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? ORDER BY title LIMIT 1  [["id", "title_header"]]
---
  def index
    id = params[:id]
    @all_ratings = MoviesController.Movie(Movie.all)
    @checked = params[:ratings] ? params[:ratings].keys : MoviesController.Movie(Movie.all)
    @date_hilite = false
    @title_hilite = false

    #Set ASC order of title or release date
    case id
      when 'title_header'
      @movies = Movie.order(:title)
      @title_hilite = true
      when 'release_date_header'
      @movies = Movie.order(:release_date)
      @date_hilite = true
      when nil
      @movies = Movie.all
    end
    #Set View to only show selected rating
    @movies = Movie.find(:all, :conditions => {:rating => @checked} ) if params[:ratings]